# What is Data Analysis?

In [2]:
# Data Analysis is a process of cleaning, transforming, model the data

# Introduction to pandas
# Pandas: For data manipulation
# Two ways we can use pandas:
    # Series: 1-D array like object
    # DataFrames: 2-D array like structure

# Reading and wrting Data:
- Read from csv

import pandas as pd
df = pd.read_csv('data.csv')
# cleaning, transforming, model the data
df.to_csv('output.csv')

# Pandas Data Structure
- Series
- DataFrames
- Panel (Deprected)

In [4]:
pip install pandas

Collecting pandas
  Downloading pandas-2.2.3-cp313-cp313-macosx_11_0_arm64.whl.metadata (89 kB)
Collecting numpy>=1.26.0 (from pandas)
  Downloading numpy-2.2.0-cp313-cp313-macosx_14_0_arm64.whl.metadata (62 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/homebrew/Cellar/jupyterlab/4.3.2_1/libexec/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Using cached pytz-2024.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Using cached tzdata-2024.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in /opt/homebrew/Cellar/jupyterlab/4.3.2_1/libexec/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.2.3-cp313-cp313-macosx_11_0_arm64.whl (11.3 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 11.3/11.3 MB 14.5 MB/s eta 0:00:001m14.8 MB/s eta 0:00:01
Downloading numpy-2.2.0-cp313-cp313-macosx_14_0_arm64.whl (5.1 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 5.1/5.1 MB 14.3 MB/s eta 0:00:0031m15.6 MB/s eta 0:00:01
Using cached pytz-2024.2-py2.py3-none-any.whl (508 kB)
Using cached tzdata-2024.2-py2.py3-none-any.whl (346 kB)
Installing collected packages: pytz, tzdata, numpy, pandas
Successfully installed numpy-2.2.0 pandas-2.2.3 pytz-2024.2 tzdata-2024.2
Note: you may need to restart the kernel to use updated packages.

In [3]:
# Series in Pandas

import pandas as pd

ModuleNotFoundError: No module named 'pandas'

In [9]:
data = [10,20,30,40,50]
s = pd.Series(data)
print(s)

0    10
1    20
2    30
3    40
4    50
dtype: int64

Series it's like table only with two column
label   data
0       10
1       20
2       30
3       40
4       50

In [10]:
# With my custom index
s = pd.Series(data, index = ['a', 'b', 'c', 'd', 'e'])
print(s)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [11]:
# Dict
data_dict = {'a': 100, 'b': 200, 'c': 300}
s = pd.Series(data_dict)
print(s)

a    100
b    200
c    300
dtype: int64

In [14]:
# Access the data
print(s['a']) # Access with label
print(s[1]) # Access with position/index

100
200

/var/folders/9l/bg0m6hr94rvd_mdrq_99kxlw0000gn/T/ipykernel_79610/721235082.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(s[1]) # Access with index

In [15]:
print(s * 2)

a    200
b    400
c    600
dtype: int64

In [16]:
print(s + 2)

a    102
b    202
c    302
dtype: int64

In [17]:
# Data Frame in Python
# It looks like a table of data base

In [31]:
# From a dictionary lists
data = {
    'Name' : ['Mohit', 'Karan', 'Aman'],
    'Age': [25, 26, 27],
    'City': ['New York', 'Delhi', 'Mumbai']
}

df = pd.DataFrame(data)
print(df)

    Name  Age      City
0  Mohit   25  New York
1  Karan   26     Delhi
2   Aman   27    Mumbai

In [20]:
# From a list of dictionary
data = [

    {
        'Name': 'Mohit',
        'Age': 25,
        'City': 'New York'
    },
    {
        'Name': 'Karan',
        'Age': 26,
        'City': 'Delhi'
    },
    {
        'Name': 'Aman',
        'Age': 27,
        'City': 'Mumbai'
    }
]

df = pd.DataFrame(data)
print(df)

    Name  Age      City
0  Mohit   25  New York
1  Karan   26     Delhi
2   Aman   27    Mumbai

In [21]:
# Access row & Column
print(df['Name'])

0    Mohit
1    Karan
2     Aman
Name: Name, dtype: object

In [22]:
#Access with label
print(df.loc[0])

Name       Mohit
Age           25
City    New York
Name: 0, dtype: object

In [24]:
#Access with poition/index
print(df.iloc[0])

Name       Mohit
Age           25
City    New York
Name: 0, dtype: object

In [25]:
# Add Column
df['Salary'] = [50, 60, 70]
print(df)

    Name  Age      City  Salary
0  Mohit   25  New York      50
1  Karan   26     Delhi      60
2   Aman   27    Mumbai      70

In [26]:
# Remove a column
df = df.drop('Salary', axis=1)
print(df)

    Name  Age      City
0  Mohit   25  New York
1  Karan   26     Delhi
2   Aman   27    Mumbai

In [27]:
filter_df = df[ df['Age'] > 25 ]
print(filter_df)

    Name  Age    City
1  Karan   26   Delhi
2   Aman   27  Mumbai

In [28]:
# Handling Missing Data
df['Age'] = [25, None, 27]
print(df)

    Name   Age      City
0  Mohit  25.0  New York
1  Karan   NaN     Delhi
2   Aman  27.0    Mumbai

In [29]:
# Check missing values/data
print(df.isnull())

    Name    Age   City
0  False  False  False
1  False   True  False
2  False  False  False

In [30]:
# Fill missing values
df['Age'].fillna(30, inplace=True)
print(df)

    Name   Age      City
0  Mohit  25.0  New York
1  Karan  30.0     Delhi
2   Aman  27.0    Mumbai

/var/folders/9l/bg0m6hr94rvd_mdrq_99kxlw0000gn/T/ipykernel_79610/2244317486.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(30, inplace=True)

In [32]:
df.fillna({'Age': 30}, inplace=True)
print(df)

    Name   Age      City
0  Mohit  25.0  New York
1  Karan  30.0     Delhi
2   Aman  27.0    Mumbai

In [42]:
# Mearning & Joining
df1 = pd.DataFrame({'ID': [1,2, 3], 'Name': ['Mohit', 'Karan', 'Aman']})
print(df1)
print("===================")
print(df2)
print("===================")
df2 = pd.DataFrame({'ID': [2,3], 'City': ['Delhi', 'Mumbai']})

merged = pd.merge(df1, df2, on='ID', how='inner')
print(merged)

   ID   Name
0   1  Mohit
1   2  Karan
2   3   Aman
===================
   ID    City
0   2   Delhi
1   3  Mumbai
===================
   ID   Name    City
0   2  Karan   Delhi
1   3   Aman  Mumbai

In [43]:
# Group By Aggregation

data = {

    'Team': ['A', 'B', 'A', 'B', 'B', 'C'],
    'Points': [10, 15, 25, 10, 14, 17]
    
}
df = pd.DataFrame(data)
print(df)

  Team  Points
0    A      10
1    B      15
2    A      25
3    B      10
4    B      14
5    C      17

In [44]:
grouped = df.groupby('Team').sum()
print(grouped)

      Points
Team
A         35
B         39
C         17

In [47]:
# Sorting
sorted_df = df.sort_values(by='Points', ascending=False)
print(sorted_df)

  Team  Points
2    A      25
5    C      17
1    B      15
4    B      14
0    A      10
3    B      10

In [48]:
# Basic Function
print(df)

  Team  Points
0    A      10
1    B      15
2    A      25
3    B      10
4    B      14
5    C      17

In [49]:
print(df.head()) # Return the first 5 rows

  Team  Points
0    A      10
1    B      15
2    A      25
3    B      10
4    B      14

In [50]:
print(df.tail())# Return the last 5 rows

  Team  Points
1    B      15
2    A      25
3    B      10
4    B      14
5    C      17

In [51]:
print(df.shape)

(6, 2)

In [52]:
print(df.columns)

Index(['Team', 'Points'], dtype='object')

In [53]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Team    6 non-null      object
 1   Points  6 non-null      int64
dtypes: int64(1), object(1)
memory usage: 228.0+ bytes
None

In [55]:
print(df.describe()) # Statistival summary of numeric column

          Points
count   6.000000
mean   15.166667
std     5.564770
min    10.000000
25%    11.000000
50%    14.500000
75%    16.500000
max    25.000000

In [56]:
print(df['Team'])

0    A
1    B
2    A
3    B
4    B
5    C
Name: Team, dtype: object

In [57]:
print(df[['Team', 'Points']])

  Team  Points
0    A      10
1    B      15
2    A      25
3    B      10
4    B      14
5    C      17

In [2]:
data = [10, 20, 30]
series = pd.Series(data)
print(series)

0    10
1    20
2    30
dtype: int64

In [4]:
import numpy as np

In [5]:
arr = np.array([10, 20, 30, 40])
series = pd.Series(arr)
print(series)

0    10
1    20
2    30
3    40
dtype: int64

In [6]:
data = {
    'a': 100,
    'b': 200,
    'c': 300
}

series = pd.Series(data)
print(series)

a    100
b    200
c    300
dtype: int64

In [9]:
series = pd.Series([42, 43, 44], index=['x', 'y', 'z'])
print(series)

x    42
y    43
z    44
dtype: int64

In [10]:
print(series['y']) # Access by index

43

In [11]:
print(series[2])

44

/var/folders/9l/bg0m6hr94rvd_mdrq_99kxlw0000gn/T/ipykernel_40188/1844690404.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(series[2])

In [12]:
series = pd.Series([10, 20, 30, 40], index=['a', 'b', 'c', 'd'])
print(series)

a    10
b    20
c    30
d    40
dtype: int64

In [16]:
# Slice with index
print(series['b':])

b    20
c    30
d    40
dtype: int64

In [18]:
print(series['b':'d'])

b    20
c    30
d    40
dtype: int64

In [21]:
# Slice with position [1, 3)
print(series[1:3])

b    20
c    30
dtype: int64

In [22]:
series = pd.Series([1,2,3,4])
print(series + 5)

0    6
1    7
2    8
3    9
dtype: int64

In [23]:
print(series * 5)

0     5
1    10
2    15
3    20
dtype: int64

In [24]:
# Boolean Index
print(series[series > 2])

2    3
3    4
dtype: int64

In [26]:
# Student Grades
# Create a Series to store student grades and analyze the data

grades = pd.Series({'Alice': 85, 'Charlie': 75, 'Diana': 95})
print(grades)

Alice      85
Charlie    75
Diana      95
dtype: int64

In [27]:
print(grades['Diana'])

95

In [28]:
high_score = grades[grades > 80]
print(high_score)

Alice    85
Diana    95
dtype: int64

In [29]:
# Apply 5 point to each grade
improved_grade = grades + 5 
print(improved_grade)

Alice       90
Charlie     80
Diana      100
dtype: int64

# Data Frames

In [32]:
data = {
    'Name' : ['Mohit', 'Karan', 'Aman'],
    'Age': [25, 26, 27],
    'City': ['New York', 'Delhi', 'Mumbai']
}

df = pd.DataFrame(data)
print(df)

    Name  Age      City
0  Mohit   25  New York
1  Karan   26     Delhi
2   Aman   27    Mumbai

In [33]:
df = pd.DataFrame(data, index=['A1', 'A2', 'A3'])
df

     Name  Age      City
A1  Mohit   25  New York
A2  Karan   26     Delhi
A3   Aman   27    Mumbai

In [34]:
data = np.array([[25, 50000], [30, 55000], [27, 90000]])
data

array([[   25, 50000],
       [   30, 55000],
       [   27, 90000]])

In [37]:
df = pd.DataFrame(data, columns=['Age', 'Salary'], index=['Alice', 'Bob', 'Mohit'])
df

       Age  Salary
Alice   25   50000
Bob     30   55000
Mohit   27   90000

In [38]:
df = pd.DataFrame(columns = ['Name','Age', 'Salary'])
df

Empty DataFrame
Columns: [Name, Age, Salary]
Index: []

In [40]:
df.loc[0] = ['Mohit', 27, 90000]
df.loc[1] = ['Bob', 30, 80000]
df

    Name  Age  Salary
0  Mohit   27   90000
1    Bob   30   80000

In [41]:
data = [[25, 50000], [30, 55000], [27, 90000]]
df = pd.DataFrame(data, columns=['Age', 'Salary'], index=['Alice', 'Bob', 'Mohit'])
df

       Age  Salary
Alice   25   50000
Bob     30   55000
Mohit   27   90000

In [42]:
# Sales Data

# Create DF for montly Sales of three product
data = {
    'Month': ['Jan', 'Feb', 'March'],
    'Porduct A': [100, 150, 300],
    'Porduct B': [80, 120, 190],
    'Porduct C': [50, 100, 80]
}

df = pd.DataFrame(data)
df

   Month  Porduct A  Porduct B  Porduct C
0    Jan        100         80         50
1    Feb        150        120        100
2  March        300        190         80

In [43]:
# Create DF to store the attendence of employee for a week

data = {
    'Employee': ['Alice', 'Bob', 'Mohit'],
    'Mon': [1, 1, 0],
    'Tue': [0, 1, 1]
}

df = pd.DataFrame(data)
df

  Employee  Mon  Tue
0    Alice    1    0
1      Bob    1    1
2    Mohit    0    1

In [44]:
# Arithmetic Operators in python pandas

In [55]:
series1 = pd.Series([10,20,30], index=['a', 'b', 'c'])
series2 = pd.Series([1,2,3], index=['a', 'b', 'c'])

print(series1 + series2)

a    11
b    22
c    33
dtype: int64

In [46]:
print(series1 * series2)

a    10
b    40
c    90
dtype: int64

In [47]:
df1 = pd.DataFrame({'A': [1,2], 'B': [3,4]})
df1

   A  B
0  1  3
1  2  4

In [52]:
df2 = pd.DataFrame({'A': [5,6], 'B': [7,8]})
df2

   A  B
0  5  7
1  6  8

In [53]:
df1 + df2

   A   B
0  6  10
1  8  12

In [56]:
df1

   A  B
0  1  3
1  2  4

In [57]:
df1 + 10

    A   B
0  11  13
1  12  14

In [59]:
data = {

    'Employee': ['Alice', 'Bob', 'Mohit'],
    'Salary': [50000, 60000, 70000]
}

df = pd.DataFrame(data)
df

  Employee  Salary
0    Alice   50000
1      Bob   60000
2    Mohit   70000

In [60]:
# Apply 10 %
df['Update Salary'] = df['Salary'] * 1.1
df

  Employee  Salary  Update Salary
0    Alice   50000        55000.0
1      Bob   60000        66000.0
2    Mohit   70000        77000.0

In [61]:
# Sales Data
data = {

    'Product': ['Item A', 'Item B', 'Item C'],
    'Units Sold': [100, 200, 300],
    'Price Per Unit': [10, 20, 15]
}

df = pd.DataFrame(data)
df

  Product  Units Sold  Price Per Unit
0  Item A         100              10
1  Item B         200              20
2  Item C         300              15

In [62]:
# Total Revenue & Per Item Revenue

# Total Revenue
df['Total Revenue'] = df['Units Sold'] * df['Price Per Unit']
df

  Product  Units Sold  Price Per Unit  Total Revenue
0  Item A         100              10           1000
1  Item B         200              20           4000
2  Item C         300              15           4500

In [66]:
print(df['Total Revenue'].sum())

9500

In [67]:
# Daily Temp
data = {
    'Day': ['Mon', 'Tue', 'Wed'],
    'Temp (C)': [20, 25, 22]
}

df = pd.DataFrame(data)
df

   Day  Temp (C)
0  Mon        20
1  Tue        25
2  Wed        22

In [68]:
df['Temp (F)'] = df['Temp (C)'] * 9/5 + 32
df

   Day  Temp (C)  Temp (F)
0  Mon        20      68.0
1  Tue        25      77.0
2  Wed        22      71.6

In [69]:
# Profit & Loss Calculation

data = {

    'Product': ['A', 'B', 'C'],
    'Cost Price': [50, 80, 120],
    'Selling Price': [70, 75, 150]
}
df = pd.DataFrame(data)
df

  Product  Cost Price  Selling Price
0       A          50             70
1       B          80             75
2       C         120            150

In [70]:
df['Profit/Loss'] = df['Selling Price'] - df['Cost Price']
df

  Product  Cost Price  Selling Price  Profit/Loss
0       A          50             70           20
1       B          80             75           -5
2       C         120            150           30

In [71]:
df['Profitable'] = df['Profit/Loss'] > 0
df

  Product  Cost Price  Selling Price  Profit/Loss  Profitable
0       A          50             70           20        True
1       B          80             75           -5       False
2       C         120            150           30        True

# Insert or Delete in Pandas

In [72]:
#drop()

In [73]:
df

  Product  Cost Price  Selling Price  Profit/Loss  Profitable
0       A          50             70           20        True
1       B          80             75           -5       False
2       C         120            150           30        True

In [80]:
df.drop('Product', axis=1, inplace=True)

In [81]:
df

   Cost Price  Selling Price  Profit/Loss  Profitable
0          50             70           20        True
1          80             75           -5       False
2         120            150           30        True

In [82]:
df.drop(0, axis=0, inplace=True)

In [83]:
df

   Cost Price  Selling Price  Profit/Loss  Profitable
1          80             75           -5       False
2         120            150           30        True

In [5]:
import pandas as pd

In [17]:
data = {
    'Name' : ['Mohit', 'Karan', 'Aman'],
    'Age': [25, 26, 27],
    'City': ['New York', 'Delhi', 'Mumbai']
}

df = pd.DataFrame(data)
df

    Name  Age      City
0  Mohit   25  New York
1  Karan   26     Delhi
2   Aman   27    Mumbai

In [7]:
# Delete the row with index = 1
df_dropped = df.drop(labels=1, axis=0)
df_dropped

    Name  Age      City
0  Mohit   25  New York
2   Aman   27    Mumbai

In [8]:
# Delete multiple rows
df_dropped = df.drop(labels=[0,1], axis=0)
df_dropped

   Name  Age    City
2  Aman   27  Mumbai

In [9]:
# Delete City Column
df_dropped = df.drop(labels=['City'], axis=1)
df_dropped

    Name  Age
0  Mohit   25
1  Karan   26
2   Aman   27

In [10]:
# Delete City, Age Column
df_dropped = df.drop(labels=['City', 'Age'], axis=1)
df_dropped

    Name
0  Mohit
1  Karan
2   Aman

In [12]:
# Delete using del cmd
# del cmd delete is also inplace delete
del df['Name']
df

   Age      City
0   25  New York
1   26     Delhi
2   27    Mumbai

# Insert Data in Pandas

In [23]:
# Insert Data in column
# insert()
# Syntex: insert(loc, column, val, allow_duplicates=False)

In [14]:
df

   Age      City
0   25  New York
1   26     Delhi
2   27    Mumbai

In [18]:
# Direct insert
df['Salary'] = [10, 20, 30]
df

    Name  Age      City  Salary
0  Mohit   25  New York      10
1  Karan   26     Delhi      20
2   Aman   27    Mumbai      30

In [19]:
df.insert(1, 'Department', ['HR', 'Finance', 'IT'])
df

    Name Department  Age      City  Salary
0  Mohit         HR   25  New York      10
1  Karan    Finance   26     Delhi      20
2   Aman         IT   27    Mumbai      30

In [20]:
# assign() it create a new DataFrame with new column
new_df = df.assign(Bouns = [5000, 6000, 7000])
new_df

    Name Department  Age      City  Salary  Bouns
0  Mohit         HR   25  New York      10   5000
1  Karan    Finance   26     Delhi      20   6000
2   Aman         IT   27    Mumbai      30   7000

In [21]:
df

    Name Department  Age      City  Salary
0  Mohit         HR   25  New York      10
1  Karan    Finance   26     Delhi      20
2   Aman         IT   27    Mumbai      30

In [24]:
#Insert Data in Row
# 1) loc or iloc

In [25]:
new_row = {'Name': 'David', 'Department': 'IT', 'Age': 44, 'City': 'Kerla', 'Salary':66 }
df.loc[3] = new_row
df

    Name Department  Age      City  Salary
0  Mohit         HR   25  New York      10
1  Karan    Finance   26     Delhi      20
2   Aman         IT   27    Mumbai      30
3  David         IT   44     Kerla      66

In [26]:
new_row = {'Name': 'Alic', 'Department': 'HR', 'Age': 33, 'City': 'New York', 'Salary':12 }
df.iloc[0] = new_row
df

    Name Department  Age      City  Salary
0   Alic         HR   33  New York      12
1  Karan    Finance   26     Delhi      20
2   Aman         IT   27    Mumbai      30
3  David         IT   44     Kerla      66

In [26]:
new_row = {'Name': 'Alic', 'Department': 'HR', 'Age': 33, 'City': 'New York', 'Salary':12 }
df.iloc[0] = new_row
df

    Name Department  Age      City  Salary
0   Alic         HR   33  New York      12
1  Karan    Finance   26     Delhi      20
2   Aman         IT   27    Mumbai      30
3  David         IT   44     Kerla      66

In [35]:
# Number of rows
len(df)

4

In [37]:
# Concat Function

# Create New Row df
new_row = {'Name': 'Mohit', 'Department': 'IT', 'Age': 30, 'City': 'Panchkula', 'Salary':400 }
new_df = pd.DataFrame(new_row, index=[len(df)])


df_new = pd.concat([df, new_df], ignore_index=True)
df_new

    Name Department  Age       City  Salary
0   Alic         HR   33   New York      12
1  Karan    Finance   26      Delhi      20
2   Aman         IT   27     Mumbai      30
3  David         IT   44      Kerla      66
4  Mohit         IT   30  Panchkula     400

In [38]:
# Modify a Sales Report

data = {

    'Product': ['A', 'B', 'C'],
    'Sales': [100, 200, 300]
}

df = pd.DataFrame(data)
df

  Product  Sales
0       A    100
1       B    200
2       C    300

In [42]:
#Add a Region Column
df['Region'] = ['North', 'South', 'West']
df

  Product  Sales Region
0       A    100  North
1       B    200  South
2       C    300   West

In [43]:
df = df.drop('Region', axis= 1)
df

  Product  Sales
0       A    100
1       B    200
2       C    300

In [46]:
new_row = {'Product': 'D', 'Sales': 400}
len_df = len(df)
print(len_df)
df.loc[len_df] = new_row
df

3

  Product  Sales
0       A    100
1       B    200
2       C    300
3       D    400

# Read & Write Data to CSV Files in Pandas

In [47]:
# Read a CSV File

In [48]:
df = pd.read_csv('sample_data.csv')
df

   ID     Name  Age  Salary Department
0   1    Alice   25   50000         HR
1   2      Bob   30   60000    Finance
2   3  Charlie   35   70000         IT
3   4    Diana   28   55000  Marketing
4   5      Eve   40   80000      Sales

In [49]:
# User my 'ID' column as a index
df = pd.read_csv('sample_data.csv', index_col='ID')
df

       Name  Age  Salary Department
ID
1     Alice   25   50000         HR
2       Bob   30   60000    Finance
3   Charlie   35   70000         IT
4     Diana   28   55000  Marketing
5       Eve   40   80000      Sales

In [51]:
# Read only 'Name', 'Salary'
df = pd.read_csv('sample_data.csv', usecols=['Name', 'Salary', 'Department'])
df

      Name  Salary Department
0    Alice   50000         HR
1      Bob   60000    Finance
2  Charlie   70000         IT
3    Diana   55000  Marketing
4      Eve   80000      Sales

In [53]:
# How DF handle the missing data
df = pd.read_csv('sample_data.csv')
df

   ID     Name  Age  Salary Department
0   1    Alice   25   50000         HR
1   2      Bob   30   60000    Finance
2   3  Charlie   35   70000         IT
3   4    Diana   28   55000  Marketing
4   5      Eve   40   80000      Sales
5   6      NaN   45    5000        NaN

In [54]:
del df['Age']
df

   ID     Name  Salary Department
0   1    Alice   50000         HR
1   2      Bob   60000    Finance
2   3  Charlie   70000         IT
3   4    Diana   55000  Marketing
4   5      Eve   80000      Sales
5   6      NaN    5000        NaN

In [55]:
# Write to csv file
df.to_csv('output_data.csv')

In [56]:
# Ignore index value
df.to_csv('output_data.csv', index=False)

In [60]:
# Write the selected columns
df[['Name', 'Department']].to_csv('output_data.csv', index=False)

In [62]:
# Custom seprator with '|'
df.to_csv('output_data.csv', index=False, sep='|')

In [67]:
# Remove Header
df.to_csv('output_data.csv', index=False, header=False)

In [68]:
df

   ID     Name  Salary Department
0   1    Alice   50000         HR
1   2      Bob   60000    Finance
2   3  Charlie   70000         IT
3   4    Diana   55000  Marketing
4   5      Eve   80000      Sales
5   6      NaN    5000        NaN

In [73]:
df = pd.read_csv('sample_data.csv', skiprows=range(1, 4))
df

   ID   Name  Age  Salary Department
0   4  Diana   28   55000  Marketing
1   5    Eve   40   80000      Sales
2   6    NaN   45    5000        NaN

# Pandas Function

# Data Inspection
- df.head(n)
- df.tail(n)
- df.info()
- df.describe()
- df.shape
- df.columns
- df.dtypes

In [80]:
# Custom Purchase Data
data = {
    'Customer_ID': [101, 102, 103, 104, 105, 106],
    'Name': ['Mohit', 'Aman', 'Karan', 'Walid', 'Alice', 'Sunil'],
    'Age': [20, 30, 40, 50, 60, None],
    'Total_Purchase': [200, 300, 150, 400, 250, None],
    'Country': ['India', 'USA', 'UK', 'Canada', 'Germany', None]
}

df = pd.DataFrame(data)

In [76]:
df

   Customer_ID   Name  Age  Total_Purchase  Country
0          101  Mohit   20             200    India
1          102   Aman   30             300      USA
2          103  Karan   40             150       UK
3          104  Walid   50             400   Canada
4          105  Alice   60             250  Germany

In [77]:
df.head(3)

   Customer_ID   Name  Age  Total_Purchase Country
0          101  Mohit   20             200   India
1          102   Aman   30             300     USA
2          103  Karan   40             150      UK

In [78]:
df.tail(2)

   Customer_ID   Name  Age  Total_Purchase  Country
3          104  Walid   50             400   Canada
4          105  Alice   60             250  Germany

In [81]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Customer_ID     6 non-null      int64
 1   Name            6 non-null      object
 2   Age             5 non-null      float64
 3   Total_Purchase  5 non-null      float64
 4   Country         5 non-null      object
dtypes: float64(2), int64(1), object(2)
memory usage: 372.0+ bytes

In [82]:
df.describe()

       Customer_ID        Age  Total_Purchase
count     6.000000   5.000000         5.00000
mean    103.500000  40.000000       260.00000
std       1.870829  15.811388        96.17692
min     101.000000  20.000000       150.00000
25%     102.250000  30.000000       200.00000
50%     103.500000  40.000000       250.00000
75%     104.750000  50.000000       300.00000
max     106.000000  60.000000       400.00000

In [83]:
df

   Customer_ID   Name   Age  Total_Purchase  Country
0          101  Mohit  20.0           200.0    India
1          102   Aman  30.0           300.0      USA
2          103  Karan  40.0           150.0       UK
3          104  Walid  50.0           400.0   Canada
4          105  Alice  60.0           250.0  Germany
5          106  Sunil   NaN             NaN     None

In [84]:
# Select a row 1, 2 [1, 3)
df.iloc[1:3]

   Customer_ID   Name   Age  Total_Purchase Country
1          102   Aman  30.0           300.0     USA
2          103  Karan  40.0           150.0      UK

In [85]:
# [1, 2]
df.loc[1:2]

   Customer_ID   Name   Age  Total_Purchase Country
1          102   Aman  30.0           300.0     USA
2          103  Karan  40.0           150.0      UK

In [88]:
# Select Customer with Total Purchases > 250
df[df['Total_Purchase'] > 150]

   Customer_ID   Name   Age  Total_Purchase  Country
0          101  Mohit  20.0           200.0    India
1          102   Aman  30.0           300.0      USA
3          104  Walid  50.0           400.0   Canada
4          105  Alice  60.0           250.0  Germany

In [91]:
df.loc[df['Age'] > 30, ['Name', 'Age']]

    Name   Age
2  Karan  40.0
3  Walid  50.0
4  Alice  60.0

In [98]:
new_df = df[df['Age'] > 30]
new_df[['Name', 'Age']]

    Name   Age
2  Karan  40.0
3  Walid  50.0
4  Alice  60.0

In [99]:
df.columns

Index(['Customer_ID', 'Name', 'Age', 'Total_Purchase', 'Country'], dtype='object')

In [100]:
df.shape

(6, 5)

In [101]:
df.dtypes

Customer_ID         int64
Name               object
Age               float64
Total_Purchase    float64
Country            object
dtype: object

# Data Cleaning
- df.isnull()
- df.notnull()
- df.dropna()
- df.fillna()
- df.replace()
- df.rename()

In [102]:
df = pd.read_csv('student_grades.csv')
df

   ID     Name  Age  Math  Science  English
0   1    Alice   17  85.0       90     78.0
1   2      Bob   18  88.0       92      NaN
2   3  Charlie   17   NaN       85     80.0
3   4    Diana   19  95.0       93     89.0
4   5      Eve   18   NaN       91     88.0
5   5      Eve   18   NaN       91     88.0

In [103]:
df.isnull() # use to detect the missing values

      ID   Name    Age   Math  Science  English
0  False  False  False  False    False    False
1  False  False  False  False    False     True
2  False  False  False   True    False    False
3  False  False  False  False    False    False
4  False  False  False   True    False    False
5  False  False  False   True    False    False

In [104]:
# Drop rows with missing data
df_cleared = df.dropna()
df_cleared

   ID   Name  Age  Math  Science  English
0   1  Alice   17  85.0       90     78.0
3   4  Diana   19  95.0       93     89.0

In [105]:
# fillna() use to fill the missing data
df['Math'] = df['Math'].fillna(50)
df

   ID     Name  Age  Math  Science  English
0   1    Alice   17  85.0       90     78.0
1   2      Bob   18  88.0       92      NaN
2   3  Charlie   17  50.0       85     80.0
3   4    Diana   19  95.0       93     89.0
4   5      Eve   18  50.0       91     88.0
5   5      Eve   18  50.0       91     88.0

In [106]:
# fillna() use to fill the missing data
df['English'] = df['English'].fillna(40)
df

   ID     Name  Age  Math  Science  English
0   1    Alice   17  85.0       90     78.0
1   2      Bob   18  88.0       92     40.0
2   3  Charlie   17  50.0       85     80.0
3   4    Diana   19  95.0       93     89.0
4   5      Eve   18  50.0       91     88.0
5   5      Eve   18  50.0       91     88.0

In [107]:
# Detect Duplicates
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [108]:
df_no_duplicate = df.drop_duplicates()
df_no_duplicate

   ID     Name  Age  Math  Science  English
0   1    Alice   17  85.0       90     78.0
1   2      Bob   18  88.0       92     40.0
2   3  Charlie   17  50.0       85     80.0
3   4    Diana   19  95.0       93     89.0
4   5      Eve   18  50.0       91     88.0